exploded/Alpaca-RG11-ESP32-SafetyMonitor/src/main.cpp
/*
 * Alpaca RG-11 Safety Monitor (Arduino framework)
 *
 * Board  : ESP32-WROOM-32 DevKit (30-pin) on a screw-terminal expansion board
 * Sensor : Hydreon RG-11 rain sensor relay  COM -> GPIO 27, NO -> GND
 *          plus a 4.7k pull-up from GPIO 27 to 3V3 (see README — the external
 *          pull-up is required, it supplies the relay's contact wetting current)
 * Display: GC9A01 1.28" round TFT, 240x240, seated directly on the first seven
 *          header pins: VCC GND SCL SDA DC CS RST -> 3V3 GND D15 D2 D4 D16 D17.
 *          Pin numbers live in platformio.ini as TFT_eSPI build flags.
 *
 * The device is unattended overnight, so it supervises itself: a task watchdog
 * catches hung handlers, a WiFi supervisor escalates from re-associate to
 * reboot, and a diagnostics record in RTC memory survives those reboots so the
 * cause is still visible afterwards at http://<ip>/.
 *
 * WiFi credentials live in include/secrets.h (git-ignored).
 * Copy include/secrets.h.example -> include/secrets.h and fill in your values.
 */

#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <AsyncUDP.h>
#include <TFT_eSPI.h>
#include <esp_task_wdt.h>
#include <time.h>
#include "secrets.h"

// ── Pins ──────────────────────────────────────────────────────────────────────
// GPIO 27 has no strapping or boot function and supports the internal pull-up.
// Do NOT move this to 34/35/36/39 — those are input-only with no pull-up, so
// INPUT_PULLUP compiles and silently does nothing.
#define RAIN_PIN        27

// ── Ports ─────────────────────────────────────────────────────────────────────
#define INFO_PORT          80
#define ALPACA_PORT     11111
#define DISC_PORT       32227

// ── Debounce ──────────────────────────────────────────────────────────────────
#define DEB_SAMPLES        5   // majority-vote window
#define DEB_INTERVAL_MS  100   // sample every 100 ms -> 500 ms settling time

// ── Watchdogs ─────────────────────────────────────────────────────────────────
// 1. Hardware task watchdog — reboots if loop() stops running (hung handler,
//    deadlock, wedged network stack). Fed once per loop() iteration.
// 2. WiFi supervisor — polls the link, re-associates, and finally reboots if
//    the association can't be recovered.
// 3. Heap floor — the HTTP handlers build responses with String concatenation;
//    if that ever leaks, reboot before the allocator starts failing.
#define WDT_TIMEOUT_S             30
#define WIFI_CHECK_INTERVAL_MS    5000UL   // how often to poll link state
#define WIFI_RECONNECT_WAIT_MS   15000UL   // grace period per reconnect attempt
#define WIFI_MAX_RECONNECT_TRIES  4        // ~60 s down, then reboot
#define BOOT_WIFI_REBEGIN_TRIES   30       // 30 x 500 ms = 15 s, then re-begin
#define BOOT_WIFI_MAX_TRIES       60       // 60 x 500 ms = 30 s, then reboot
#define HEAP_FLOOR_BYTES      40000UL      // reboot below this much free heap

// ── Time (house convention: Melbourne, DST handled by configTzTime) ───────────
static const char *TZ_INFO      = "AEST-10AEDT,M10.1.0/2,M4.1.0/3";
static const char *NTP_SERVER_1 = "pool.ntp.org";
static const char *NTP_SERVER_2 = "time.nist.gov";
#define TIME_SYNCED_EPOCH  1704067200UL   // 2024-01-01; anything below = not synced

// ── Display geometry / palette ────────────────────────────────────────────────
#define SCR_W      240
#define SCR_H      240
#define CX         120
#define CY         120
#define R_OUTER    120
#define R_INNER     98   // leaves a 22 px coloured annulus

static constexpr uint16_t COL_BG   = TFT_BLACK;
static constexpr uint16_t COL_TEXT = 0xDEFB;  // near-white
static constexpr uint16_t COL_DIM  = 0x7BEF;  // grey
static constexpr uint16_t COL_GOOD = 0x2661;  // green
static constexpr uint16_t COL_BAD  = 0xE124;  // red

// ── Global objects ────────────────────────────────────────────────────────────
WebServer   webServer(INFO_PORT);     // human-readable status page
WebServer   httpServer(ALPACA_PORT);  // ASCOM Alpaca API
AsyncUDP    asyncUdp;

TFT_eSPI    tft;
TFT_eSprite spr(&tft);
static bool g_spriteOk = false;
// Drawing goes through this so the layout code is identical whether we render
// into the off-screen sprite or straight to the panel.
static TFT_eSPI *gfx = &tft;

// ── Sensor / Alpaca state (single loop – no concurrent tasks – no mutex) ──────
static int      g_rawLevel   = 1;
static int      g_debounced  = 1;
static uint32_t g_lastChange = 0;
static uint32_t g_totalTrans = 0;
static bool     g_alpacaConn = false;
static uint32_t g_serverTxId = 1;
static String   g_uniqueId;          // MAC-derived, built in setup()

// Debounce ring buffer
static int  g_samples[DEB_SAMPLES];
static int  g_sampleIdx = 0;

// Loop timers
static uint32_t g_nextDebounce  = 0;
static uint32_t g_nextDisplay   = 0;
static uint32_t g_nextHeartbeat = 0;

// ── Diagnostics ───────────────────────────────────────────────────────────────
// Lives in RTC memory, which survives a software reset and a watchdog reset but
// not a power cycle. That's exactly what we want: if the device reboots itself
// overnight, the reason is still on the status page in the morning.
//
// Bump the magic whenever the layout below changes, otherwise a reflash can find
// stale RTC contents that still match the old magic and decode as garbage.
#define DIAG_MAGIC   0x52473131UL   // "RG11" — rev 1
#define DIAG_EVENTS  12

enum DiagEvent : uint8_t {
    EV_NONE = 0, EV_BOOT, EV_WIFI_LOST, EV_WIFI_OK, EV_REBOOT, EV_RAIN, EV_DRY
};

struct DiagEntry {
    uint32_t epoch;      // 0 if the clock wasn't synced yet
    uint32_t uptimeSec;
    uint8_t  type;
    uint8_t  detail;     // EV_WIFI_LOST: the 802.11 disconnect reason code
};

struct DiagRecord {
    uint32_t  magic;
    uint32_t  bootCount;
    uint32_t  wifiDrops;   // cumulative across reboots, unlike s_wifiDropCount
    uint8_t   head;
    DiagEntry ev[DIAG_EVENTS];
};

RTC_NOINIT_ATTR DiagRecord s_diag;

static const char *diagEventName(uint8_t t)
{
    switch (t) {
        case EV_BOOT:      return "boot";
        case EV_WIFI_LOST: return "WiFi lost";
        case EV_WIFI_OK:   return "WiFi recovered";
        case EV_REBOOT:    return "self-reboot";
        case EV_RAIN:      return "RAIN — unsafe";
        case EV_DRY:       return "dry — safe";
        default:           return "";
    }
}

static const char *resetReasonName()
{
    switch (esp_reset_reason()) {
        case ESP_RST_POWERON:   return "power-on";
        case ESP_RST_SW:        return "software restart";
        case ESP_RST_PANIC:     return "panic / exception";
        case ESP_RST_TASK_WDT:  return "TASK WATCHDOG";
        case ESP_RST_INT_WDT:   return "interrupt watchdog";
        case ESP_RST_WDT:       return "other watchdog";
        case ESP_RST_BROWNOUT:  return "BROWNOUT (power dip)";
        case ESP_RST_EXT:       return "external reset pin";
        case ESP_RST_DEEPSLEEP: return "deep sleep wake";
        default:                return "unknown";
    }
}

static void diagLog(DiagEvent type, uint8_t detail = 0)
{
    DiagEntry &e = s_diag.ev[s_diag.head];
    time_t now   = time(nullptr);
    e.epoch      = (now > (time_t)TIME_SYNCED_EPOCH) ? (uint32_t)now : 0;
    e.uptimeSec  = millis() / 1000UL;
    e.type       = (uint8_t)type;
    e.detail     = detail;
    s_diag.head  = (s_diag.head + 1) % DIAG_EVENTS;
}

// The common 802.11 reason codes, so the log reads without a lookup table.
// 15 in particular means the AP's group-key rotation timed out — a classic
// cause of a single unexplained nightly drop.
static const char *wifiReasonName(uint8_t r)
{
    switch (r) {
        case 1:   return "unspecified";
        case 2:   return "auth expired";
        case 4:   return "assoc expired (AP idle timeout)";
        case 8:   return "AP deauthenticated us";
        case 15:  return "4-way handshake timeout (group rekey)";
        case 200: return "beacon timeout (AP unreachable)";
        case 201: return "no AP found";
        case 202: return "auth failed";
        case 203: return "assoc failed";
        default:  return "";
    }
}

