exploded/Alpaca-RG11-ESP32-SafetyMonitor/src/main.cpp
// Local wall-clock string, or an uptime fallback when NTP hadn't synced yet.
static String diagWhen(const DiagEntry &e)
{
    if (e.epoch == 0) return "+" + String(e.uptimeSec) + "s (no clock)";
    time_t t = (time_t)e.epoch;
    struct tm tmv;
    localtime_r(&t, &tmv);
    char buf[24];
    strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
    return String(buf);
}

// Diagnostics card for the status page — newest event first.
static String diagCardHtml()
{
    String h = "<div class='card'><h2>Diagnostics</h2>"
               "<p><strong>Last reset:</strong> " + String(resetReasonName()) + "</p>"
               "<p><strong>Boots since power-on:</strong> " + String(s_diag.bootCount) + "</p>"
               "<p><strong>WiFi drops since power-on:</strong> " + String(s_diag.wifiDrops) + "</p>";

    time_t now = time(nullptr);
    h += "<p><strong>Clock:</strong> ";
    if (now > (time_t)TIME_SYNCED_EPOCH) {
        struct tm tmv;
        localtime_r(&now, &tmv);
        char buf[24];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &tmv);
        h += buf;
    } else {
        h += "not synced";
    }
    h += "</p>";

    h += "<table><tr><th align='left'>When</th><th align='left'>Event</th></tr>";
    bool any = false;
    for (int i = 0; i < DIAG_EVENTS; i++) {
        // walk backwards from the most recently written slot
        int idx = (s_diag.head - 1 - i + 2 * DIAG_EVENTS) % DIAG_EVENTS;
        const DiagEntry &e = s_diag.ev[idx];
        if (e.type == EV_NONE) continue;
        any = true;
        String what = diagEventName(e.type);
        if (e.type == EV_WIFI_LOST) {
            what += " — reason " + String(e.detail);
            const char *rn = wifiReasonName(e.detail);
            if (rn[0]) what += " (" + String(rn) + ")";
        }
        h += "<tr><td><code>" + diagWhen(e) + "</code></td><td>" + what + "</td></tr>";
    }
    if (!any) h += "<tr><td colspan='2'>no events recorded</td></tr>";
    h += "</table></div>";
    return h;
}

// ── WiFi supervisor state ─────────────────────────────────────────────────────
static uint32_t s_lastWifiCheckMs = 0;
static uint32_t s_wifiDownSinceMs = 0;   // 0 = link is up
static uint8_t  s_wifiRetries     = 0;
static uint32_t s_wifiDropCount   = 0;   // reported on the status page

// Set from the WiFi event task, consumed in loop(). The handler must stay this
// trivial: WiFi.begin()/disconnect() must not be called from the event context,
// so all it does is raise a flag that forces the next poll to run immediately.
static volatile bool    s_wifiEvtDisconnected  = false;
static volatile bool    s_wifiEvtGotIp         = false;
static volatile uint8_t s_wifiDisconnectReason = 0;

static void onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info)
{
    switch (event) {
        case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            s_wifiDisconnectReason = info.wifi_sta_disconnected.reason;
            s_wifiEvtDisconnected  = true;
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
            s_wifiEvtGotIp = true;
            break;
        default:
            break;
    }
}

// ── Display ───────────────────────────────────────────────────────────────────
//
//  displayInit()    – bring up the panel, returns true on success
//  displayMessage() – two-line boot-progress message
//  displayUpdate()  – periodic status screen (called every 1 s)
//
//  240 x 240 round layout:
//    a 22 px coloured annulus at the rim — green SAFE / red NOT SAFE —
//    around a black centre carrying the text.  Everything is drawn into an
//    8-bit off-screen sprite (57.6 kB) and pushed in one go, so there is no
//    flicker even though the GC9A01 itself has no frame buffer.

static bool displayInit()
{
    tft.init();
    tft.setRotation(0);
    tft.fillScreen(COL_BG);

    spr.setColorDepth(8);
    g_spriteOk = (spr.createSprite(SCR_W, SCR_H) != nullptr);
    gfx = g_spriteOk ? (TFT_eSPI *)&spr : &tft;

    Serial.printf("GC9A01 initialised (240x240), sprite %s\n",
                  g_spriteOk ? "OK" : "FAILED - drawing direct");
    return true;
}

static void displayPush()
{
    if (g_spriteOk) spr.pushSprite(0, 0);
}

static void displayMessage(const char *l1, const String &l2)
{
    gfx->fillScreen(COL_BG);
    gfx->setTextDatum(MC_DATUM);
    gfx->setTextColor(COL_TEXT, COL_BG);
    gfx->setTextFont(4);
    gfx->drawString(l1, CX, CY - 16);
    gfx->setTextFont(2);
    gfx->drawString(l2, CX, CY + 16);
    displayPush();
}

static void displayUpdate()
{
    const bool     safe = (g_debounced == 1);
    const uint16_t ring = safe ? COL_GOOD : COL_BAD;
    const bool     up   = (WiFi.status() == WL_CONNECTED);

    gfx->fillScreen(COL_BG);
    gfx->fillCircle(CX, CY, R_OUTER, ring);
    gfx->fillCircle(CX, CY, R_INNER, COL_BG);

    gfx->setTextDatum(MC_DATUM);

    // Headline — FreeSans is the largest built-in face with a full alphabet
    // (fonts 6/7/8 are digits-only, so they can't render "SAFE").
    gfx->setTextColor(safe ? COL_GOOD : COL_BAD, COL_BG);
    gfx->setFreeFont(&FreeSansBold18pt7b);
    gfx->drawString(safe ? "SAFE" : "NOT SAFE", CX, 95);
    gfx->setTextFont(2);   // back to the built-in fonts

    gfx->setTextColor(COL_TEXT, COL_BG);
    gfx->drawString(up ? WiFi.localIP().toString() : String("No WiFi"), CX, 142);

    gfx->setTextColor(COL_DIM, COL_BG);
    gfx->drawString(String(g_alpacaConn ? "Alpaca:OK" : "Alpaca:--") +
                    "  T:" + String(g_totalTrans), CX, 168);

    gfx->setTextFont(1);
    char foot[32];
    snprintf(foot, sizeof(foot), "%ddBm  up %lum",
             up ? WiFi.RSSI() : 0, (unsigned long)(millis() / 60000UL));
    gfx->drawString(foot, CX, 192);

    displayPush();
}

// ── Restart helper ────────────────────────────────────────────────────────────
// A reboot is only ever triggered when the device is already unreachable (WiFi
// down) or already broken (heap exhausted), so unlike the roof controller there
// is nothing to defer to — no client can observe the gap either way.
static void safeRestart(const char *reason)
{
    Serial.printf("Restarting: %s\n", reason);
    diagLog(EV_REBOOT);
    displayMessage("Restarting", reason);
    Serial.flush();
    delay(1000);
    ESP.restart();
}

