exploded/Alpaca-RG11-ESP32-SafetyMonitor/src/main.cpp
// ── Alpaca UDP discovery ──────────────────────────────────────────────────────
// AsyncUDP handles receive + reply on the same socket. WiFiUDP cannot: sending
// on the socket it is listening on returns ENOMEM. Re-armed after a WiFi
// recovery because the bound socket does not reliably survive re-association.
static void startDiscovery()
{
    asyncUdp.close();
    if (!asyncUdp.listen(DISC_PORT)) {
        Serial.println("AsyncUDP listen FAILED");
        return;
    }
    asyncUdp.onPacket([](AsyncUDPPacket packet) {
        if (packet.length() < 16) return;
        if (strncmp((char *)packet.data(), "alpacadiscovery1", 16) != 0) return;
        // The discovery reply MUST contain only AlpacaPort. Adding a "Devices"
        // array here made N.I.N.A silently drop the device — clients fetch the
        // device list from /management/v1/configureddevices over HTTP once they
        // know the port.
        packet.print("{\"AlpacaPort\":" + String(ALPACA_PORT) + "}");
    });
    Serial.printf("Alpaca discovery on UDP port %d\n", DISC_PORT);
}

// ── WiFi supervisor ───────────────────────────────────────────────────────────
// Polled from loop(). Escalates: notice the drop -> re-associate -> reboot.
static void maintainWifi()
{
    // The driver knows about a drop long before a 5 s poll would notice. Rather
    // than duplicate the recovery logic, just force the poll below to run now —
    // shrinking a ~10 s outage to ~2 s, which may be short enough that clients
    // like N.I.N.A never see a failed request.
    if (s_wifiEvtDisconnected || s_wifiEvtGotIp) {
        s_wifiEvtDisconnected = false;
        s_wifiEvtGotIp        = false;
        s_lastWifiCheckMs     = 0;   // millis() - 0 always exceeds the interval
    }

    if (millis() - s_lastWifiCheckMs < WIFI_CHECK_INTERVAL_MS) return;
    s_lastWifiCheckMs = millis();

    if (WiFi.status() == WL_CONNECTED) {
        if (s_wifiDownSinceMs != 0) {
            Serial.print("WiFi recovered, IP: ");
            Serial.println(WiFi.localIP());
            diagLog(EV_WIFI_OK);
            startDiscovery();   // rebind the discovery socket
        }
        s_wifiDownSinceMs = 0;
        s_wifiRetries     = 0;
        return;
    }

    // First time we've seen the link down — kick off a reconnect immediately.
    if (s_wifiDownSinceMs == 0) {
        s_wifiDownSinceMs = millis();
        s_wifiRetries     = 0;
        s_wifiDropCount++;
        s_diag.wifiDrops++;
        uint8_t reason = s_wifiDisconnectReason;
        Serial.printf("WiFi link lost (reason %u %s) — reconnecting\n",
                      reason, wifiReasonName(reason));
        diagLog(EV_WIFI_LOST, reason);
        WiFi.disconnect();
        WiFi.begin(WIFI_SSID, WIFI_PASS);
        return;
    }

    // Give the current attempt its full grace period before doing anything else.
    if (millis() - s_wifiDownSinceMs < WIFI_RECONNECT_WAIT_MS) return;

    if (s_wifiRetries >= WIFI_MAX_RECONNECT_TRIES) {
        safeRestart("WiFi down");
        return;
    }

    s_wifiRetries++;
    Serial.printf("WiFi reconnect attempt %u/%u\n", s_wifiRetries, WIFI_MAX_RECONNECT_TRIES);
    WiFi.disconnect();
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    s_wifiDownSinceMs = millis();
}

// ── Alpaca response helpers ───────────────────────────────────────────────────

static void addCors()
{
    httpServer.sendHeader("Access-Control-Allow-Origin",  "*");
    httpServer.sendHeader("Access-Control-Allow-Methods", "GET, PUT, OPTIONS");
    httpServer.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}

static uint32_t clientTx()
{
    String s = httpServer.arg("ClientTransactionID");
    return s.length() ? (uint32_t)s.toInt() : 0;
}

static void sendBool(bool v)
{
    g_alpacaConn = true;
    uint32_t tx = clientTx(), stx = g_serverTxId++;
    addCors();
    httpServer.send(200, "application/json",
        "{\"ClientTransactionID\":" + String(tx) +
        ",\"ServerTransactionID\":" + String(stx) +
        ",\"ErrorNumber\":0,\"ErrorMessage\":\"\",\"Value\":" +
        (v ? "true" : "false") + "}");
}

static void sendInt(int v)
{
    g_alpacaConn = true;
    uint32_t tx = clientTx(), stx = g_serverTxId++;
    addCors();
    httpServer.send(200, "application/json",
        "{\"ClientTransactionID\":" + String(tx) +
        ",\"ServerTransactionID\":" + String(stx) +
        ",\"ErrorNumber\":0,\"ErrorMessage\":\"\",\"Value\":" + String(v) + "}");
}

static void sendStr(const char *v)
{
    g_alpacaConn = true;
    uint32_t tx = clientTx(), stx = g_serverTxId++;
    addCors();
    httpServer.send(200, "application/json",
        "{\"ClientTransactionID\":" + String(tx) +
        ",\"ServerTransactionID\":" + String(stx) +
        ",\"ErrorNumber\":0,\"ErrorMessage\":\"\",\"Value\":\"" + String(v) + "\"}");
}

static void sendArr(const String &v)
{
    uint32_t tx = clientTx(), stx = g_serverTxId++;
    addCors();
    httpServer.send(200, "application/json",
        "{\"ClientTransactionID\":" + String(tx) +
        ",\"ServerTransactionID\":" + String(stx) +
        ",\"ErrorNumber\":0,\"ErrorMessage\":\"\",\"Value\":" + v + "}");
}

// ── Status page (port 80) ─────────────────────────────────────────────────────

static void hRoot()
{
    // The Alpaca API is on port 11111; build the absolute base URL so the JS
    // fetch works correctly even though this page is served from port 80.
    String apiBase = "http://" + WiFi.localIP().toString() + ":" + String(ALPACA_PORT);
    String html =
        "<html><head><meta charset='UTF-8'>"
        "<meta http-equiv='refresh' content='10'>"
        "<style>body{font-family:Arial,sans-serif;margin:24px;background:#f5f5f5}"
        "h1{color:#333}h2{margin:0 0 8px;font-size:1.1em;color:#555}"
        ".safe{color:green;font-weight:bold}.unsafe{color:red;font-weight:bold}"
        ".card{background:#fff;padding:16px;margin:12px 0;border-radius:8px;"
        "box-shadow:0 2px 6px rgba(0,0,0,.1)}"
        "table{border-collapse:collapse;width:100%}"
        "th,td{padding:4px 8px;border-bottom:1px solid #eee;font-size:.9em}"
        "</style></head>"
        "<body><h1>RG-11 Safety Monitor</h1>"

