exploded/Alpaca-RG11-ESP32-SafetyMonitor/src/main.cpp
        "<div class='card'><h2>Status</h2>"
        "<p><strong>Status:</strong> <span id='s'>--</span></p>"
        "<p><strong>GPIO " + String(RAIN_PIN) + ":</strong> <span id='r'>--</span></p>"
        "<p><strong>Transitions:</strong> " + String(g_totalTrans) +
        " | <strong>Alpaca:</strong> " + (g_alpacaConn ? "Connected" : "Disconnected") +
        " | <strong>IP:</strong> " + WiFi.localIP().toString() + "</p></div>"

        "<div class='card'><h2>Link</h2>"
        "<p><strong>Uptime:</strong> " + String(millis() / 60000UL) + " min</p>"
        "<p><strong>WiFi RSSI:</strong> " + String(WiFi.RSSI()) + " dBm</p>"
        "<p><strong>WiFi drops since boot:</strong> " + String(s_wifiDropCount) + "</p>"
        "<p><strong>Free heap:</strong> " + String(ESP.getFreeHeap()) + " bytes</p>"
        "</div>"

        + diagCardHtml() +

        "<script>var B='" + apiBase + "';"
        "function u(){"
        "fetch(B+'/api/v1/safetymonitor/0/issafe').then(r=>r.json()).then(d=>{"
        "const s=d.Value===true;"
        "document.getElementById('s').innerHTML=s?"
        "'<span class=\"safe\">SAFE</span>':'<span class=\"unsafe\">NOT SAFE (RAIN)</span>';"
        "document.getElementById('r').innerHTML=s?"
        "'<span style=\"color:green\">HIGH (1)</span>'"
        ":'<span style=\"color:red\">LOW (0)</span>';"
        "}).catch(()=>{document.getElementById('s').innerHTML='Error';});}"
        "setInterval(u,500);u();</script></body></html>";
    webServer.send(200, "text/html", html);
}

// ── Alpaca handlers ───────────────────────────────────────────────────────────

static void hFavicon()          { webServer.send(404); }
static void hIsSafe()           { sendBool(g_debounced == 1); }
static void hConnectedGet()     { sendBool(true); }
static void hConnectedPut()     { g_alpacaConn = true; sendBool(true); }
static void hDescription()      { sendStr("Hydreon RG-11 Optical Rain Sensor Safety Monitor"); }
static void hDriverInfo()       { sendStr("ESP32 Alpaca Safety Monitor (Arduino)"); }
static void hDriverVersion()    { sendStr("3.0.0"); }
// ISafetyMonitorV2 – the classic Connected property, which is what this
// firmware implements. Claiming 3 (Platform 7) would promise the async
// Connect/Disconnect/Connecting methods that are not served here.
static void hInterfaceVersion() { sendInt(2); }
static void hName()             { sendStr("Alpaca RG-11 Safety Monitor"); }
static void hSupportedActions() { sendArr("[]"); }
static void hDeviceState()      { sendArr("[]"); }

static void hMgmtApiVersions()  { sendArr("[1]"); }

static void hMgmtDescription()
{
    uint32_t tx = clientTx(), stx = g_serverTxId++;
    addCors();
    httpServer.send(200, "application/json",
        "{\"ClientTransactionID\":" + String(tx) +
        ",\"ServerTransactionID\":" + String(stx) +
        ",\"ErrorNumber\":0,\"ErrorMessage\":\"\","
        "\"Value\":{\"ServerName\":\"RG-11 Safety Monitor\",\"Manufacturer\":\"DIY\","
        "\"ManufacturerVersion\":\"3.0\",\"Location\":\"Observatory\"}}");
}

static void hMgmtDevices()
{
    sendArr("[{\"DeviceType\":\"SafetyMonitor\","
            "\"DeviceName\":\"RG-11 Safety Monitor\","
            "\"DeviceNumber\":0,\"UniqueID\":\"" + g_uniqueId + "\"}]");
}

static void hNotFound()
{
    if (httpServer.method() == HTTP_OPTIONS) {
        addCors();
        httpServer.send(200);
        return;
    }
    httpServer.send(404, "text/plain", "Not found");
}

static void hNotFound80() { webServer.send(404, "text/plain", "Not found"); }

// ── Debounce (called every DEB_INTERVAL_MS) ───────────────────────────────────

static void runDebounce()
{
    int s = digitalRead(RAIN_PIN);
    g_samples[g_sampleIdx] = s;
    g_sampleIdx = (g_sampleIdx + 1) % DEB_SAMPLES;

    int highs = 0;
    for (int i = 0; i < DEB_SAMPLES; i++) if (g_samples[i]) highs++;
    int newDeb = (highs > DEB_SAMPLES / 2) ? 1 : 0;

    g_rawLevel = s;
    if (newDeb != g_debounced) {
        g_debounced  = newDeb;
        g_lastChange = millis();
        g_totalTrans++;
        diagLog(g_debounced ? EV_DRY : EV_RAIN);
        Serial.printf("State change → debounced=%d (%s)\n",
                      g_debounced, g_debounced ? "SAFE" : "UNSAFE");
    }
}

// ── setup ─────────────────────────────────────────────────────────────────────

void setup()
{
    Serial.begin(115200);
    Serial.println("\n\n=== RG-11 Safety Monitor booting ===");

    // Diagnostics record — RTC memory is garbage after a power cycle, so gate on
    // both the magic and the reset reason before trusting it.
    esp_reset_reason_t rr = esp_reset_reason();
    if (s_diag.magic != DIAG_MAGIC || rr == ESP_RST_POWERON) {
        memset(&s_diag, 0, sizeof(s_diag));
        s_diag.magic = DIAG_MAGIC;
    }
    s_diag.bootCount++;
    Serial.printf("Reset reason: %s (boot #%lu)\n", resetReasonName(),
                  (unsigned long)s_diag.bootCount);

    displayInit();
    displayMessage("RG-11 Monitor", "WiFi connecting...");

    // Rain sensor GPIO. Seed the debounce state from the real pin level so the
    // device never reports SAFE during the first debounce window while it is
    // actually raining.
    pinMode(RAIN_PIN, INPUT_PULLUP);
    int initial = digitalRead(RAIN_PIN);
    for (int i = 0; i < DEB_SAMPLES; i++) g_samples[i] = initial;
    g_rawLevel  = initial;
    g_debounced = initial;

    // WiFi — re-begin at 15 s, restart at 30 s
    WiFi.persistent(false);        // don't wear out flash rewriting the same creds
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);          // modem sleep makes the link flaky under polling
    WiFi.setAutoReconnect(true);   // first line of defence; maintainWifi() backs it up
    WiFi.setHostname("rg11");
    WiFi.onEvent(onWiFiEvent);     // must be registered before begin()
    WiFi.begin(WIFI_SSID, WIFI_PASS);
    Serial.print("Connecting to WiFi");
    {
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED) {
            delay(500);
            Serial.print('.');
            ++attempts;

            // Half way — tear the association down and start over. Cheaper than
            // a reboot and clears a stuck WPA handshake.
            if (attempts == BOOT_WIFI_REBEGIN_TRIES) {
                Serial.print(" retrying");
                WiFi.disconnect(true);
                delay(200);
                WiFi.mode(WIFI_STA);
                WiFi.begin(WIFI_SSID, WIFI_PASS);
            }

