exploded/Alpaca-RG11-ESP32-SafetyMonitor/src/main.cpp
            if (attempts >= BOOT_WIFI_MAX_TRIES) {
                Serial.println("\nWiFi failed — restarting in 3 s");
                displayMessage("WiFi FAILED", "Restarting...");
                delay(3000);
                ESP.restart();
            }
        }
    }
    Serial.printf("\nConnected! IP: %s\n", WiFi.localIP().toString().c_str());
    displayMessage("WiFi OK!", WiFi.localIP().toString());

    // Stable per-device Alpaca identity. A hardcoded UniqueID would collide with
    // the unit this one replaces if both are powered on during changeover.
    g_uniqueId = "RG11-SM-" + WiFi.macAddress();
    g_uniqueId.replace(":", "");
    Serial.printf("Alpaca UniqueID: %s\n", g_uniqueId.c_str());

    // NTP — non-blocking, syncs in the background. Only needed so the event log
    // carries wall-clock times that line up with N.I.N.A's log.
    configTzTime(TZ_INFO, NTP_SERVER_1, NTP_SERVER_2);
    diagLog(EV_BOOT);

    delay(1500);   // let the boot message be read

    // Web status page – port 80 (human-readable, no port number needed)
    webServer.on("/",            HTTP_GET, hRoot);
    webServer.on("/favicon.ico", HTTP_GET, hFavicon);
    webServer.onNotFound(hNotFound80);
    webServer.begin();
    Serial.printf("Web status page on port %d\n", INFO_PORT);

    // Alpaca API – port 11111
    httpServer.on("/api/v1/safetymonitor/0/issafe",           HTTP_GET, hIsSafe);
    httpServer.on("/api/v1/safetymonitor/0/connected",        HTTP_GET, hConnectedGet);
    httpServer.on("/api/v1/safetymonitor/0/connected",        HTTP_PUT, hConnectedPut);
    httpServer.on("/api/v1/safetymonitor/0/description",      HTTP_GET, hDescription);
    httpServer.on("/api/v1/safetymonitor/0/driverinfo",       HTTP_GET, hDriverInfo);
    httpServer.on("/api/v1/safetymonitor/0/driverversion",    HTTP_GET, hDriverVersion);
    httpServer.on("/api/v1/safetymonitor/0/interfaceversion", HTTP_GET, hInterfaceVersion);
    httpServer.on("/api/v1/safetymonitor/0/name",             HTTP_GET, hName);
    httpServer.on("/api/v1/safetymonitor/0/supportedactions", HTTP_GET, hSupportedActions);
    httpServer.on("/api/v1/safetymonitor/0/devicestate",      HTTP_GET, hDeviceState);
    httpServer.on("/management/apiversions",                  HTTP_GET, hMgmtApiVersions);
    httpServer.on("/management/v1/description",               HTTP_GET, hMgmtDescription);
    httpServer.on("/management/v1/configureddevices",         HTTP_GET, hMgmtDevices);
    httpServer.onNotFound(hNotFound);
    httpServer.begin();
    Serial.printf("Alpaca API on port %d\n", ALPACA_PORT);

    startDiscovery();

    g_lastChange   = millis();
    g_nextDebounce = millis() + DEB_INTERVAL_MS;
    g_nextDisplay  = millis() + 1000;

    // Hardware task watchdog — armed last so a slow setup() can't trip it.
    // If loop() stops feeding it for WDT_TIMEOUT_S the chip resets.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    esp_task_wdt_config_t wdtCfg = {
        .timeout_ms     = WDT_TIMEOUT_S * 1000,
        .idle_core_mask = 0,
        .trigger_panic  = true
    };
    // Core 3.x may already have initialised the TWDT — reconfigure in that case.
    if (esp_task_wdt_init(&wdtCfg) == ESP_ERR_INVALID_STATE) {
        esp_task_wdt_reconfigure(&wdtCfg);
    }
#else
    esp_task_wdt_init(WDT_TIMEOUT_S, true);
#endif
    esp_task_wdt_add(NULL);   // watch the Arduino loop task
    Serial.printf("Task watchdog armed (%d s)\n", WDT_TIMEOUT_S);

    Serial.println("=== Setup complete – entering loop ===");
    displayUpdate();
}

// ── loop ──────────────────────────────────────────────────────────────────────

void loop()
{
    esp_task_wdt_reset();   // feed the hardware watchdog

    uint32_t now = millis();

    webServer.handleClient();
    httpServer.handleClient();
    // Discovery is handled by the AsyncUDP callback – nothing to poll here

    maintainWifi();

    if ((int32_t)(now - g_nextDebounce) >= 0) {
        g_nextDebounce = now + DEB_INTERVAL_MS;
        runDebounce();
    }

    if ((int32_t)(now - g_nextDisplay) >= 0) {
        g_nextDisplay = now + 1000;
        displayUpdate();
    }

    if ((int32_t)(now - g_nextHeartbeat) >= 0) {
        g_nextHeartbeat = now + 30000;
        Serial.printf("HB: GPIO%d=%d safe=%s WiFi=%s RSSI=%d heap=%u drops=%lu\n",
                      RAIN_PIN, g_rawLevel,
                      g_debounced ? "Y" : "N",
                      WiFi.status() == WL_CONNECTED
                          ? WiFi.localIP().toString().c_str()
                          : "DOWN",
                      WiFi.RSSI(), (unsigned)ESP.getFreeHeap(),
                      (unsigned long)s_wifiDropCount);

        // Heap floor — the String-building handlers are the only plausible leak
        // source; reboot before the allocator starts failing requests.
        if (ESP.getFreeHeap() < HEAP_FLOOR_BYTES) {
            safeRestart("low heap");
        }
    }
}
